espressif/esp-idf/components/soc/esp32p4/include/soc/twaifd_struct.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: ID register */
/** Type of device_id register
 *  TWAI FD device id status register
 */
typedef union {
    struct {
        /** device_id : R/W; bitpos: [31:0]; default: 51965;
         *  Represents whether CAN IP function is mapped correctly on its base address.
         */
        uint32_t device_id:32;
    };
    uint32_t val;
} twaifd_device_id_reg_t;


/** Group: Configuration register */
/** Type of mode_setting register
 *  TWAI FD mode setting register
 */
typedef union {
    struct {
        /** sw_reset : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to reset the TWAI FD controller.\\
         *  0: invalid\\
         *  1: reset.\\
         */
        uint32_t sw_reset:1;
        /** listen_only_mode : R/W; bitpos: [1]; default: 0;
         *  bus monitor enable
         */
        uint32_t listen_only_mode:1;
        /** self_test_mode : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to enable the self test mode.\\
         *  0: disable\\
         *  1: enable\\
         */
        uint32_t self_test_mode:1;
        /** accept_filter_mode : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to enable the usage of acceptance filters.\\
         *  0: disable\\
         *  1: enable\\
         */
        uint32_t accept_filter_mode:1;
        /** flexible_data_rate : R/W; bitpos: [4]; default: 1;
         *  Configures whether or not to support flexible data rate.\\
         *  0: not support\\
         *  1: support\\
         */
        uint32_t flexible_data_rate:1;
        /** rtr_frm_behavior : R/W; bitpos: [5]; default: 0;
         *  time_triggered transmission mode
         */
        uint32_t rtr_frm_behavior:1;
        /** rom : R/W; bitpos: [6]; default: 0;
         *  a\\
         */
        uint32_t rom:1;
        /** ack_behavior : R/W; bitpos: [7]; default: 0;
         *  Configures the acknowledge behavior.\\
         *  0: normal behavior.\\
         *  1: acknowledge is not sent.\\
         */
        uint32_t ack_behavior:1;
        /** test_mode : R/W; bitpos: [8]; default: 0;
         *  Configures whether or not to enable the triple sampling mode.\\
         *  0: disable\\
         *  1: enable\\
         */
        uint32_t test_mode:1;
        /** rxbam : R/W; bitpos: [9]; default: 1;
         *  a\\
         */
        uint32_t rxbam:1;
        uint32_t reserved_10:6;
        /** limit_retx_en : R/W; bitpos: [16]; default: 0;
         *  Configures whether or not to enable the limit of retransmission.\\
         *  0: disable\\
         *  1: enable\\
         */
        uint32_t limit_retx_en:1;
        /** retx_thres : R/W; bitpos: [20:17]; default: 0;
         *  Configures the threshold of retransmission attempts. \\
         */
        uint32_t retx_thres:4;
        /** ilbp : R/W; bitpos: [21]; default: 0;
         *  acknowledge forbidden mode
         */
        uint32_t ilbp:1;
        /** ctrl_en : R/W; bitpos: [22]; default: 0;
         *  Configures whether or not to enable the twai FD controller.\\
         *  0: disable\\
         *  1: enable\\
         */
        uint32_t ctrl_en:1;
        /** fd_type : R/W; bitpos: [23]; default: 0;
         *  Configure the twai fd frame type.\\
         *  0: ISO CAN FD\\
         *  1: CAN FD 1.0\\
         */
        uint32_t fd_type:1;
        /** pex : R/W; bitpos: [24]; default: 0;
         *  protocol expection mode\\
         */
        uint32_t pex:1;
        /** tbfbo : R/W; bitpos: [25]; default: 1;
         *  a\\
         */
        uint32_t tbfbo:1;
        /** fdrf : R/W; bitpos: [26]; default: 0;
         *  a\\
         */
        uint32_t fdrf:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} twaifd_mode_setting_reg_t;

/** Type of command register
 *  TWAI FD command register
 */
typedef union {
    struct {
        uint32_t reserved_0:1;
        /** rxrpmv : WO; bitpos: [1]; default: 0;
         *  a\\
         */
        uint32_t rxrpmv:1;
        /** release_rx_buf : WO; bitpos: [2]; default: 0;
         *  Configures whether or not to delete all data from the receive buffer.\\
         *  0: invalid\\
         *  1: delete\\
         */
        uint32_t release_rx_buf:1;
        /** clr_overrun_flg : WO; bitpos: [3]; default: 0;
         *  Configures whether or not to clear the data overrun flag.\\
         *  0: invalid\\
         *  1: clear\\
         */
        uint32_t clr_overrun_flg:1;
        /** ercrst : WO; bitpos: [4]; default: 0;
         *  a\\
         */
        uint32_t ercrst:1;
        /** rxfcrst : WO; bitpos: [5]; default: 0;
         *  a\\
         */
        uint32_t rxfcrst:1;
        /** txfcrst : WO; bitpos: [6]; default: 0;
         *  a\\
         */
        uint32_t txfcrst:1;
        /** cpexs : WO; bitpos: [7]; default: 0;
         *  a\\
         */
        uint32_t cpexs:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} twaifd_command_reg_t;

/** Type of bit_timing register
 *  TWAI FD bit-timing  register
 */
typedef union {
    struct {
        /** prop : R/W; bitpos: [6:0]; default: 5;
         *  Configures the propagation segment of nominal bit rate.\\
         *  Measurement unit: time quanta\\
         */
        uint32_t prop:7;
        /** ph1 : R/W; bitpos: [12:7]; default: 3;
         *  Configures the phase 1 segment of nominal bit rate.\\
         *  Measurement unit: time quanta\\
         */
        uint32_t ph1:6;
        /** ph2 : R/W; bitpos: [18:13]; default: 5;
         *  Configures the phase 2 segment of nominal bit rate.\\
         *  Measurement unit: time quanta\\
         */
        uint32_t ph2:6;
        /** brp : R/W; bitpos: [26:19]; default: 16;
         *  Configures the baud-rate prescaler of nominal bit rate.\\
         *  Measurement unit: cycle of core clock.
         */
        uint32_t brp:8;
        /** sjw : R/W; bitpos: [31:27]; default: 2;
         *  Represents the synchronization jump width in nominal bit time.\\
         *  Measurement unit: time quanta\\
         */
        uint32_t sjw:5;
    };
    uint32_t val;
} twaifd_bit_timing_reg_t;

/** Type of bit_timeing_fd register
 *  TWAI FD bit-timing of FD register
 */
typedef union {
    struct {
        /** prop_fd : R/W; bitpos: [5:0]; default: 3;
         *  Configures the propagation segment of data bit rate.\\
         *  Measurement unit: time quanta\\
         */
        uint32_t prop_fd:6;
        uint32_t reserved_6:1;
        /** ph1_fd : R/W; bitpos: [11:7]; default: 3;
         *  Configures the phase 1 segment of data bit rate.\\
         *  Measurement unit: time quanta\\
         */
        uint32_t ph1_fd:5;
        uint32_t reserved_12:1;
        /** ph2_fd : R/W; bitpos: [17:13]; default: 3;
         *  Configures the phase 2 segment of data bit rate.\\
         *  Measurement unit: time quanta\\
         */
        uint32_t ph2_fd:5;
        uint32_t reserved_18:1;
        /** brp_fd : R/W; bitpos: [26:19]; default: 4;
         *  Configures the baud-rate prescaler of data bit rate.\\
         *  Measurement unit: cycle of core clock.
         */
        uint32_t brp_fd:8;
        /** sjw_fd : R/W; bitpos: [31:27]; default: 2;
         *  Represents the synchronization jump width in data bit time.\\
         *  Measurement unit: time quanta\\
         */
        uint32_t sjw_fd:5;
    };
    uint32_t val;
} twaifd_bit_timeing_fd_reg_t;

/** Type of tx_cfg register
 *  TWAI FD TX buffer configuration register
 */
typedef union {
    struct {
        /** txt_1_allow : R/W; bitpos: [0]; default: 1;
         *  Configures whether or not allow transmitting frames from TX buffer1.\\
         *  0: not allow\\
         *  1: allow\\
         */
        uint32_t txt_1_allow:1;
        /** txt_2_allow : R/W; bitpos: [1]; default: 1;
         *  Configures whether or not allow transmitting frames from TX buffer2.\\
         *  0: not allow\\
         *  1: allow\\
         */
        uint32_t txt_2_allow:1;
        /** txt_1_commit : WT; bitpos: [2]; default: 0;
         *  Configures whether or not the frames from TX register are inserted into TX
         *  buffer1.\\
         *  0: not inserted\\
         *  1: inserted\\
         */
        uint32_t txt_1_commit:1;
        /** txt_2_commit : WT; bitpos: [3]; default: 0;
         *  Configures whether or not the frames from TX register are inserted into TX
         *  buffer2.\\
         *  0: not inserted\\
         *  1: inserted\\
         */
        uint32_t txt_2_commit:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} twaifd_tx_cfg_reg_t;

/** Type of trv_delay_ssp_cfg register
 *  TWAI FD transmit delay & secondary sample point configuration register
 */
typedef union {
    struct {
        /** trv_delay_value : RO; bitpos: [6:0]; default: 0;
         *  a\\
         */
        uint32_t trv_delay_value:7;
        uint32_t reserved_7:9;
        /** ssp_offset : R/W; bitpos: [23:16]; default: 10;
         *  a\\
         */
        uint32_t ssp_offset:8;
        /** ssp_src : R/W; bitpos: [25:24]; default: 0;
         *  a\\
         */
        uint32_t ssp_src:2;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} twaifd_trv_delay_ssp_cfg_reg_t;


/** Group: Status register */
/** Type of status register
 *  TWAI FD status register
 */
typedef union {
    struct {
        /** rx_buf_stat : RO; bitpos: [0]; default: 0;
         *  Represents whether or not the receive buffer is empty.\\
         *  0: empty\\
         *  1: not empty\\
         */
        uint32_t rx_buf_stat:1;
        /** data_overrun_flg : RO; bitpos: [1]; default: 0;
         *  Represents whether or not the receive buffer is full and the frame is
         *  overrun(lost).\\
         *  0: not overrun\\
         *  1: overrun\\
         */
        uint32_t data_overrun_flg:1;
        /** tx_buf_sat : RO; bitpos: [2]; default: 0;
         *  Represents whether or not the transmit buffer is full.\\
         *  0: not full\\
         *  1: full\\
         */
        uint32_t tx_buf_sat:1;
        /** err_frm_tx : RO; bitpos: [3]; default: 0;
         *  Represents whether or not the error frame is being transmitted.\\
         *  0: not being transmitted\\
         *  1: being transmitted\\
         */
        uint32_t err_frm_tx:1;
        /** rx_frm_stat : RO; bitpos: [4]; default: 0;
         *  Represents whether or not the controller is receiving a frame.\\
         *  0: not receiving\\
         *  1: receiving\\
         */
        uint32_t rx_frm_stat:1;
        /** tx_frm_stat : RO; bitpos: [5]; default: 0;
         *  Represents whether or not the controller is transmitting a frame.\\
         *  0: not transmitting\\
         *  1: transmitting\\
         */
        uint32_t tx_frm_stat:1;
        /** err_stat : RO; bitpos: [6]; default: 0;
         *  Represents whether or not the error warning limit is reached.\\
         *  0: not reached\\
         *  1: reached\\
         */
        uint32_t err_stat:1;
        /** bus_stat : RO; bitpos: [7]; default: 1;
         *  Represents whether or not bus is active.\\
         *  0: active\\
         *  1: not active\\
         */
        uint32_t bus_stat:1;
        /** pexs : RO; bitpos: [8]; default: 0;
         *  a\\
         */
        uint32_t pexs:1;
        /** reintegrating_wait : RO; bitpos: [9]; default: 0;
         *  fsm is in reintegrating wait status
         */
        uint32_t reintegrating_wait:1;
        uint32_t reserved_10:6;
        /** stcnt : RO; bitpos: [16]; default: 0;
         *  a\\
         */
        uint32_t stcnt:1;
        /** strgs : RO; bitpos: [17]; default: 0;
         *  a\\
         */
        uint32_t strgs:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} twaifd_status_reg_t;

