espressif/esp-idf/components/soc/esp32p4/include/soc/twaifd_struct.h
/** Type of rx_mem_info register
 *  TWAI FD rx memory information register
 */
typedef union {
    struct {
        /** rx_buff_size_val : RO; bitpos: [12:0]; default: 0;
         *  Represents the size of RX buffer.\\
         */
        uint32_t rx_buff_size_val:13;
        uint32_t reserved_13:3;
        /** rx_free_ctr : RO; bitpos: [28:16]; default: 0;
         *  Represents the number of free words in RX buffer.\\
         */
        uint32_t rx_free_ctr:13;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_rx_mem_info_reg_t;

/** Type of rx_pointers register
 *  TWAI FD rx memory pointer information register
 */
typedef union {
    struct {
        /** rx_wpt_val : RO; bitpos: [11:0]; default: 0;
         *  Represents the write pointer position in RX buffer.\\
         */
        uint32_t rx_wpt_val:12;
        uint32_t reserved_12:4;
        /** rx_rpt_val : RO; bitpos: [27:16]; default: 0;
         *  Represents the read pointer position in RX buffer.\\
         */
        uint32_t rx_rpt_val:12;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} twaifd_rx_pointers_reg_t;

/** Type of rx_status_setting register
 *  TWAI FD tx status & setting register
 */
typedef union {
    struct {
        /** rx_empty : RO; bitpos: [0]; default: 0;
         *  Represents whether or not the RX buffer is empty.\\
         *  0: not empty\\
         *  1: empty\\
         */
        uint32_t rx_empty:1;
        /** rx_full : RO; bitpos: [1]; default: 0;
         *  Represents whether or not the RX buffer is full.\\
         *  0: not full\\
         *  1: full\\
         */
        uint32_t rx_full:1;
        uint32_t reserved_2:2;
        /** rx_frm_ctr : RO; bitpos: [14:4]; default: 0;
         *  Represents the number of received frame in RX buffer.\\
         */
        uint32_t rx_frm_ctr:11;
        uint32_t reserved_15:1;
        /** rtsop : R/W; bitpos: [16]; default: 0;
         *  a\\
         */
        uint32_t rtsop:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} twaifd_rx_status_setting_reg_t;

/** Type of tx_stat register
 *  TWAI FD TX buffer status register
 */
typedef union {
    struct {
        /** txt_1_empty : RO; bitpos: [0]; default: 0;
         *  Represents whether or not the TX buffer1 is empty.\\
         *  0: not empty\\
         *  1: empty\\
         */
        uint32_t txt_1_empty:1;
        /** txt_2_empty : RO; bitpos: [1]; default: 0;
         *  Represents whether or not the TX buffer2 is empty.\\
         *  0: not empty\\
         *  1: empty\\
         */
        uint32_t txt_2_empty:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} twaifd_tx_stat_reg_t;

/** Type of err_cap_retr_ctr_alc register
 *  TWAI FD error capture & retransmit counter & arbitration lost register
 */
typedef union {
    struct {
        /** err_type : RO; bitpos: [4:0]; default: 0;
         *  a\\
         */
        uint32_t err_type:5;
        /** err_pos : RO; bitpos: [7:5]; default: 0;
         *  a\\
         */
        uint32_t err_pos:3;
        /** retr_ctr : RO; bitpos: [11:8]; default: 0;
         *  a\\
         */
        uint32_t retr_ctr:4;
        uint32_t reserved_12:4;
        /** alc_bit : RO; bitpos: [20:16]; default: 0;
         *  a\\
         */
        uint32_t alc_bit:5;
        /** alc_id_field : RO; bitpos: [23:21]; default: 0;
         *  a\\
         */
        uint32_t alc_id_field:3;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} twaifd_err_cap_retr_ctr_alc_reg_t;


/** Group: interrupt register */
/** Type of int_raw register
 *  TWAI FD interrupt raw register
 */
typedef union {
    struct {
        /** rx_frm_suc_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt status of TWAIFD_RX_FRM_SUC_INT.
         */
        uint32_t rx_frm_suc_int_raw:1;
        /** tx_frm_suc_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt status of TWAIFD_TX_FRM_SUC_INT.
         */
        uint32_t tx_frm_suc_int_raw:1;
        /** err_warning_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt status of TWAIFD_ERR_WARNING_INT.
         */
        uint32_t err_warning_int_raw:1;
        /** rx_data_overrun_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt status of TWAIFD_RX_DATA_OVERRUN_INT.
         */
        uint32_t rx_data_overrun_int_raw:1;
        uint32_t reserved_4:1;
        /** fault_confinement_chg_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt status of TWAIFD_FAULT_CONFINEMENT_CHG_INT.
         */
        uint32_t fault_confinement_chg_int_raw:1;
        /** arb_lost_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt status of TWAIFD_ARB_LOST_INT.
         */
        uint32_t arb_lost_int_raw:1;
        /** err_detected_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw interrupt status of TWAIFD_ERR_DETECTED_INT.
         */
        uint32_t err_detected_int_raw:1;
        /** is_overload_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw interrupt status of TWAIFD_IS_OVERLOAD_INT.
         */
        uint32_t is_overload_int_raw:1;
        /** rx_buf_full_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  The raw interrupt status of TWAIFD_RX_BUF_FULL_INT.
         */
        uint32_t rx_buf_full_int_raw:1;
        /** bit_rate_shift_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  The raw interrupt status of TWAIFD_BIT_RATE_SHIFT_INT.
         */
        uint32_t bit_rate_shift_int_raw:1;
        /** rx_buf_not_empty_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw interrupt status of TWAIFD_RX_BUF_NOT_EMPTY_INT.
         */
        uint32_t rx_buf_not_empty_int_raw:1;
        /** tx_buf_status_chg_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The raw interrupt status of TWAIFD_TX_BUF_STATUS_CHG_INT.
         */
        uint32_t tx_buf_status_chg_int_raw:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} twaifd_int_raw_reg_t;

/** Type of int_ena register
 *  TWAI FD interrupt enable register
 */
typedef union {
    struct {
        /** rx_frm_suc_int_ena : R/W; bitpos: [0]; default: 0;
         *  Write 1 to enable TWAIFD_RX_FRM_SUC_INT.
         */
        uint32_t rx_frm_suc_int_ena:1;
        /** tx_frm_suc_int_ena : R/W; bitpos: [1]; default: 0;
         *  Write 1 to enable TWAIFD_TX_FRM_SUC_INT.
         */
        uint32_t tx_frm_suc_int_ena:1;
        /** err_warning_int_ena : R/W; bitpos: [2]; default: 0;
         *  Write 1 to enable TWAIFD_ERR_WARNING_INT.
         */
        uint32_t err_warning_int_ena:1;
        /** rx_data_overrun_int_ena : R/W; bitpos: [3]; default: 0;
         *  Write 1 to enable TWAIFD_RX_DATA_OVERRUN_INT.
         */
        uint32_t rx_data_overrun_int_ena:1;
        uint32_t reserved_4:1;
        /** fault_confinement_chg_int_ena : R/W; bitpos: [5]; default: 0;
         *  Write 1 to enable TWAIFD_FAULT_CONFINEMENT_CHG_INT.
         */
        uint32_t fault_confinement_chg_int_ena:1;
        /** arb_lost_int_ena : R/W; bitpos: [6]; default: 0;
         *  Write 1 to enable TWAIFD_ARB_LOST_INT.
         */
        uint32_t arb_lost_int_ena:1;
        /** err_detected_int_ena : R/W; bitpos: [7]; default: 0;
         *  Write 1 to enable TWAIFD_ERR_DETECTED_INT.
         */
        uint32_t err_detected_int_ena:1;
        /** is_overload_int_ena : R/W; bitpos: [8]; default: 0;
         *  Write 1 to enable TWAIFD_IS_OVERLOAD_INT.
         */
        uint32_t is_overload_int_ena:1;
        /** rx_buf_full_int_ena : R/W; bitpos: [9]; default: 0;
         *  Write 1 to enable TWAIFD_RX_BUF_FULL_INT.
         */
        uint32_t rx_buf_full_int_ena:1;
        /** bit_rate_shift_int_ena : R/W; bitpos: [10]; default: 0;
         *  Write 1 to enable TWAIFD_BIT_RATE_SHIFT_INT.
         */
        uint32_t bit_rate_shift_int_ena:1;
        /** rx_buf_not_empty_int_ena : R/W; bitpos: [11]; default: 0;
         *  Write 1 to enable TWAIFD_RX_BUF_NOT_EMPTY_INT.
         */
        uint32_t rx_buf_not_empty_int_ena:1;
        /** tx_buf_status_chg_int_ena : R/W; bitpos: [12]; default: 0;
         *  Write 1 to enable TWAIFD_TX_BUF_STATUS_CHG_INT.
         */
        uint32_t tx_buf_status_chg_int_ena:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} twaifd_int_ena_reg_t;

/** Type of int_st register
 *  TWAI FD interrupt status register
 */
typedef union {
    struct {
        /** rx_frm_suc_int_st : RO; bitpos: [0]; default: 0;
         *  The masked interrupt status of TWAIFD_RX_FRM_SUC_INT.
         */
        uint32_t rx_frm_suc_int_st:1;
        /** tx_frm_suc_int_st : RO; bitpos: [1]; default: 0;
         *  The masked interrupt status of TWAIFD_TX_FRM_SUC_INT.
         */
        uint32_t tx_frm_suc_int_st:1;
        /** err_warning_int_st : RO; bitpos: [2]; default: 0;
         *  The masked interrupt status of TWAIFD_ERR_WARNING_INT.
         */
        uint32_t err_warning_int_st:1;
        /** rx_data_overrun_int_st : RO; bitpos: [3]; default: 0;
         *  The masked interrupt status of TWAIFD_RX_DATA_OVERRUN_INT.
         */
        uint32_t rx_data_overrun_int_st:1;
        uint32_t reserved_4:1;
        /** fault_confinement_chg_int_st : RO; bitpos: [5]; default: 0;
         *  The masked interrupt status of TWAIFD_FAULT_CONFINEMENT_CHG_INT.
         */
        uint32_t fault_confinement_chg_int_st:1;
        /** arb_lost_int_st : RO; bitpos: [6]; default: 0;
         *  The masked interrupt status of TWAIFD_ARB_LOST_INT.
         */
        uint32_t arb_lost_int_st:1;
        /** err_detected_int_st : RO; bitpos: [7]; default: 0;
         *  The masked interrupt status of TWAIFD_ERR_DETECTED_INT.
         */
        uint32_t err_detected_int_st:1;
        /** is_overload_int_st : RO; bitpos: [8]; default: 0;
         *  The masked interrupt status of TWAIFD_IS_OVERLOAD_INT.
         */
        uint32_t is_overload_int_st:1;
        /** rx_buf_full_int_st : RO; bitpos: [9]; default: 0;
         *  The masked interrupt status of TWAIFD_RX_BUF_FULL_INT.
         */
        uint32_t rx_buf_full_int_st:1;
        /** bit_rate_shift_int_st : RO; bitpos: [10]; default: 0;
         *  The masked interrupt status of TWAIFD_BIT_RATE_SHIFT_INT.
         */
        uint32_t bit_rate_shift_int_st:1;
        /** rx_buf_not_empty_int_st : RO; bitpos: [11]; default: 0;
         *  The masked interrupt status of TWAIFD_RX_BUF_NOT_EMPTY_INT.
         */
        uint32_t rx_buf_not_empty_int_st:1;
        /** tx_buf_status_chg_int_st : RO; bitpos: [12]; default: 0;
         *  The masked interrupt status of TWAIFD_TX_BUF_STATUS_CHG_INT.
         */
        uint32_t tx_buf_status_chg_int_st:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} twaifd_int_st_reg_t;

/** Type of int_clr register
 *  TWAI FD interrupt clear register
 */
typedef union {
    struct {
        /** rx_frm_suc_int_clr : WT; bitpos: [0]; default: 0;
         *  Write 1 to clear TWAIFD_RX_FRM_SUC_INT.
         */
        uint32_t rx_frm_suc_int_clr:1;
        /** tx_frm_suc_int_clr : WT; bitpos: [1]; default: 0;
         *  Write 1 to clear TWAIFD_TX_FRM_SUC_INT.
         */
        uint32_t tx_frm_suc_int_clr:1;
        /** err_warning_int_clr : WT; bitpos: [2]; default: 0;
         *  Write 1 to clear TWAIFD_ERR_WARNING_INT.
         */
        uint32_t err_warning_int_clr:1;
        /** rx_data_overrun_int_clr : WT; bitpos: [3]; default: 0;
         *  Write 1 to clear TWAIFD_RX_DATA_OVERRUN_INT.
         */
        uint32_t rx_data_overrun_int_clr:1;
        uint32_t reserved_4:1;
        /** fault_confinement_chg_int_clr : WT; bitpos: [5]; default: 0;
         *  Write 1 to clear TWAIFD_FAULT_CONFINEMENT_CHG_INT.
         */
        uint32_t fault_confinement_chg_int_clr:1;
        /** arb_lost_int_clr : WT; bitpos: [6]; default: 0;
         *  Write 1 to clear TWAIFD_ARB_LOST_INT.
         */
        uint32_t arb_lost_int_clr:1;
        /** err_detected_int_clr : WT; bitpos: [7]; default: 0;
         *  Write 1 to clear TWAIFD_ERR_DETECTED_INT.
         */
        uint32_t err_detected_int_clr:1;
        /** is_overload_int_clr : WT; bitpos: [8]; default: 0;
         *  Write 1 to clear TWAIFD_IS_OVERLOAD_INT.
         */
        uint32_t is_overload_int_clr:1;
        /** rx_buf_full_int_clr : WT; bitpos: [9]; default: 0;
         *  Write 1 to clear TWAIFD_RX_BUF_FULL_INT.
         */
        uint32_t rx_buf_full_int_clr:1;
        /** bit_rate_shift_int_clr : WT; bitpos: [10]; default: 0;
         *  Write 1 to clear TWAIFD_BIT_RATE_SHIFT_INT.
         */
        uint32_t bit_rate_shift_int_clr:1;
        /** rx_buf_not_empty_int_clr : WT; bitpos: [11]; default: 0;
         *  Write 1 to clear TWAIFD_RX_BUF_NOT_EMPTY_INT.
         */
        uint32_t rx_buf_not_empty_int_clr:1;
        /** tx_buf_status_chg_int_clr : WT; bitpos: [12]; default: 0;
         *  Write 1 to clear TWAIFD_TX_BUF_STATUS_CHG_INT.
         */
        uint32_t tx_buf_status_chg_int_clr:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} twaifd_int_clr_reg_t;


/** Group: error confinement register */
/** Type of err_th_stat register
 *  TWAI FD error threshold and status register
 */
typedef union {
    struct {
        /** err_warning_thres : R/W; bitpos: [7:0]; default: 96;
         *  Configures the error warning threshold.\\
         */
        uint32_t err_warning_thres:8;
        /** err_passive_thres : R/W; bitpos: [15:8]; default: 128;
         *  Configures the error passive threshold.\\
         */
        uint32_t err_passive_thres:8;
        /** err_active : RO; bitpos: [16]; default: 1;
         *  Represents the fault state of error active.\\
         */
        uint32_t err_active:1;
        /** err_passive : RO; bitpos: [17]; default: 0;
         *  Represents the fault state of error passive.\\
         */
        uint32_t err_passive:1;
        /** bus_off : RO; bitpos: [18]; default: 0;
         *  Represents the fault state of bus off.\\
         */
        uint32_t bus_off:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} twaifd_err_th_stat_reg_t;

/** Type of error_counters register
 *  TWAI FD error counters status register
 */
typedef union {
    struct {
        /** rxc_val : RO; bitpos: [15:0]; default: 0;
         *  Represents the receiver error counter value.\\
         */
        uint32_t rxc_val:16;
        /** txc_val : RO; bitpos: [31:16]; default: 0;
         *  Represents the transmitter error counter value.\\
         */
        uint32_t txc_val:16;
    };
    uint32_t val;
} twaifd_error_counters_reg_t;

