espressif/esp-idf/components/soc/esp32p4/include/soc/twaifd_struct.h
/** Type of error_counters_sp register
 *  TWAI FD special error counters status register
 */
typedef union {
    struct {
        /** err_fd_val : RO; bitpos: [15:0]; default: 0;
         *  Represents the number of error in the data bit time.\\
         */
        uint32_t err_fd_val:16;
        /** err_norm_val : RO; bitpos: [31:16]; default: 0;
         *  Represents the number of error in the nominal bit time.\\
         */
        uint32_t err_norm_val:16;
    };
    uint32_t val;
} twaifd_error_counters_sp_reg_t;

/** Type of ctr_pres register
 *  TWAI FD error counters pre-define configuration register
 */
typedef union {
    struct {
        /** ctr_pres_val : WO; bitpos: [8:0]; default: 0;
         *  Configures the pre-defined value to set the error counter.\\
         */
        uint32_t ctr_pres_val:9;
        /** ptx : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to set the receiver error counter into the value of
         *  pre-defined value.\\
         *  0: invalid\\
         *  1: set\\
         */
        uint32_t ptx:1;
        /** prx : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to set the transmitter error counter into the value of
         *  pre-defined value.\\
         *  0: invalid\\
         *  1: set\\
         */
        uint32_t prx:1;
        /** enorm : WO; bitpos: [11]; default: 0;
         *  Configures whether or not to erase the error counter of nominal bit time.\\
         *  0: invalid\\
         *  1: erase\\
         */
        uint32_t enorm:1;
        /** efd : WO; bitpos: [12]; default: 0;
         *  Configures whether or not to erase the error counter of data bit time.\\
         *  0: invalid\\
         *  1: erase\\
         */
        uint32_t efd:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} twaifd_ctr_pres_reg_t;


/** Group: receiver register */
/** Type of rx_data register
 *  TWAI FD received data register
 */
typedef union {
    struct {
        /** rx_data : RO; bitpos: [31:0]; default: 0;
         *  Data received.
         */
        uint32_t rx_data:32;
    };
    uint32_t val;
} twaifd_rx_data_reg_t;


/** Group: filter register */
/** Type of filter_a_mask register
 *  TWAI FD filter A mask value register
 */
typedef union {
    struct {
        /** bit_mask_a : R/W; bitpos: [28:0]; default: 0;
         *  filter A bit masked value.
         */
        uint32_t bit_mask_a:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_filter_a_mask_reg_t;

/** Type of filter_a_val register
 *  TWAI FD filter A bit value register
 */
typedef union {
    struct {
        /** bit_val_a : R/W; bitpos: [28:0]; default: 0;
         *  filter A bit value.
         */
        uint32_t bit_val_a:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_filter_a_val_reg_t;

/** Type of filter_b_mask register
 *  TWAI FD filter B mask value register
 */
typedef union {
    struct {
        /** bit_mask_b : R/W; bitpos: [28:0]; default: 0;
         *  filter A bit masked value.
         */
        uint32_t bit_mask_b:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_filter_b_mask_reg_t;

/** Type of filter_b_val register
 *  TWAI FD filter B bit value register
 */
typedef union {
    struct {
        /** bit_val_b : R/W; bitpos: [28:0]; default: 0;
         *  filter A bit value.
         */
        uint32_t bit_val_b:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_filter_b_val_reg_t;

/** Type of filter_c_mask register
 *  TWAI FD filter C mask value register
 */
typedef union {
    struct {
        /** bit_mask_c : R/W; bitpos: [28:0]; default: 0;
         *  filter A bit masked value.
         */
        uint32_t bit_mask_c:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_filter_c_mask_reg_t;

/** Type of filter_c_val register
 *  TWAI FD filter C bit value register
 */
typedef union {
    struct {
        /** bit_val_c : R/W; bitpos: [28:0]; default: 0;
         *  filter A bit value.
         */
        uint32_t bit_val_c:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_filter_c_val_reg_t;

/** Type of filter_ran_low register
 *  TWAI FD filter range low value register
 */
typedef union {
    struct {
        /** bit_ran_low : R/W; bitpos: [28:0]; default: 0;
         *  filter A bit masked value.
         */
        uint32_t bit_ran_low:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_filter_ran_low_reg_t;

/** Type of filter_ran_high register
 *  TWAI FD filter range high value register
 */
typedef union {
    struct {
        /** bit_ran_high : R/W; bitpos: [28:0]; default: 0;
         *  filter A bit value.
         */
        uint32_t bit_ran_high:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_filter_ran_high_reg_t;

/** Type of filter_control register
 *  TWAI FD filter control register
 */
typedef union {
    struct {
        /** fanb : R/W; bitpos: [0]; default: 1;
         *  filter A with nominal and base mode.
         */
        uint32_t fanb:1;
        /** fane : R/W; bitpos: [1]; default: 1;
         *  filter A with nominal and extended mode.
         */
        uint32_t fane:1;
        /** fafb : R/W; bitpos: [2]; default: 1;
         *  filter A with FD and base mode.
         */
        uint32_t fafb:1;
        /** fafe : R/W; bitpos: [3]; default: 1;
         *  filter A with FD and extended mode.
         */
        uint32_t fafe:1;
        /** fbnb : R/W; bitpos: [4]; default: 0;
         *  filter B with nominal and base mode.
         */
        uint32_t fbnb:1;
        /** fbne : R/W; bitpos: [5]; default: 0;
         *  filter B with nominal and extended mode.
         */
        uint32_t fbne:1;
        /** fbfb : R/W; bitpos: [6]; default: 0;
         *  filter B with FD and base mode.
         */
        uint32_t fbfb:1;
        /** fbfe : R/W; bitpos: [7]; default: 0;
         *  filter B with FD and extended mode.
         */
        uint32_t fbfe:1;
        /** fcnb : R/W; bitpos: [8]; default: 0;
         *  filter C with nominal and base mode.
         */
        uint32_t fcnb:1;
        /** fcne : R/W; bitpos: [9]; default: 0;
         *  filter C with nominal and extended mode.
         */
        uint32_t fcne:1;
        /** fcfb : R/W; bitpos: [10]; default: 0;
         *  filter C with FD and base mode.
         */
        uint32_t fcfb:1;
        /** fcfe : R/W; bitpos: [11]; default: 0;
         *  filter C with FD and extended mode.
         */
        uint32_t fcfe:1;
        /** frnb : R/W; bitpos: [12]; default: 0;
         *  filter range with nominal and base mode.
         */
        uint32_t frnb:1;
        /** frne : R/W; bitpos: [13]; default: 0;
         *  filter range with nominal and extended mode.
         */
        uint32_t frne:1;
        /** frfb : R/W; bitpos: [14]; default: 0;
         *  filter range with FD and base mode.
         */
        uint32_t frfb:1;
        /** frfe : R/W; bitpos: [15]; default: 0;
         *  filter range with FD and extended mode.
         */
        uint32_t frfe:1;
        /** sfa : RO; bitpos: [16]; default: 0;
         *  filter A status
         */
        uint32_t sfa:1;
        /** sfb : RO; bitpos: [17]; default: 0;
         *  filter B status
         */
        uint32_t sfb:1;
        /** sfc : RO; bitpos: [18]; default: 0;
         *  filter C status
         */
        uint32_t sfc:1;
        /** sfr : RO; bitpos: [19]; default: 0;
         *  filter range status
         */
        uint32_t sfr:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} twaifd_filter_control_reg_t;


/** Group: transmitter register */
/** Type of tx_data_0 register
 *  TWAI FD transmit data register 0
 */
typedef union {
    struct {
        /** dlc_tx : R/W; bitpos: [3:0]; default: 0;
         *  Configures the brs to be transmitted.
         */
        uint32_t dlc_tx:4;
        uint32_t reserved_4:1;
        /** rtr_tx : R/W; bitpos: [5]; default: 0;
         *  Configures the rtr bit to be transmitted.
         */
        uint32_t rtr_tx:1;
        /** id_type_tx : R/W; bitpos: [6]; default: 0;
         *  Configures the frame type to be transmitted.
         */
        uint32_t id_type_tx:1;
        /** fr_type_tx : R/W; bitpos: [7]; default: 0;
         *  Configures the fd type to be transmitted.
         */
        uint32_t fr_type_tx:1;
        /** tbf_tx : R/W; bitpos: [8]; default: 0;
         *  Configures the tbf bit to be transmitted.
         */
        uint32_t tbf_tx:1;
        /** brs_tx : R/W; bitpos: [9]; default: 0;
         *  Configures the brs bit to be transmitted.
         */
        uint32_t brs_tx:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} twaifd_tx_data_0_reg_t;

/** Type of tx_data_1 register
 *  TWAI FD transmit data register 1
 */
typedef union {
    struct {
        /** ts_val_u_tx : R/W; bitpos: [31:0]; default: 0;
         *  Configures the upper timestamp to be transmitted
         */
        uint32_t ts_val_u_tx:32;
    };
    uint32_t val;
} twaifd_tx_data_1_reg_t;

/** Type of tx_data_2 register
 *  TWAI FD transmit data register 2
 */
typedef union {
    struct {
        /** ts_val_l_tx : R/W; bitpos: [31:0]; default: 0;
         *  Configures the lower timestamp to be transmitted
         */
        uint32_t ts_val_l_tx:32;
    };
    uint32_t val;
} twaifd_tx_data_2_reg_t;

/** Type of tx_data_3 register
 *  TWAI FD transmit data register 3
 */
typedef union {
    struct {
        /** id_ext_tx : R/W; bitpos: [17:0]; default: 0;
         *  Configures the base ID to be transmitted
         */
        uint32_t id_ext_tx:18;
        /** id_base_tx : R/W; bitpos: [28:18]; default: 0;
         *  Configures the extended ID to be transmitted
         */
        uint32_t id_base_tx:11;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_tx_data_3_reg_t;

/** Type of tx_data_4 register
 *  TWAI FD transmit data register 4
 */
typedef union {
    struct {
        /** tx_data0 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 0th word to be transmitted
         */
        uint32_t tx_data0:32;
    };
    uint32_t val;
} twaifd_tx_data_4_reg_t;

