espressif/esp-idf/components/soc/esp32p4/include/soc/twaifd_struct.h
/** Type of tx_data_5 register
 *  TWAI FD transmit data register 5
 */
typedef union {
    struct {
        /** tx_data1 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 1th word to be transmitted
         */
        uint32_t tx_data1:32;
    };
    uint32_t val;
} twaifd_tx_data_5_reg_t;

/** Type of tx_data_6 register
 *  TWAI FD transmit data register 6
 */
typedef union {
    struct {
        /** tx_data2 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 2th word to be transmitted
         */
        uint32_t tx_data2:32;
    };
    uint32_t val;
} twaifd_tx_data_6_reg_t;

/** Type of tx_data_7 register
 *  TWAI FD transmit data register 7
 */
typedef union {
    struct {
        /** tx_data3 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 3th word to be transmitted
         */
        uint32_t tx_data3:32;
    };
    uint32_t val;
} twaifd_tx_data_7_reg_t;

/** Type of tx_data_8 register
 *  TWAI FD transmit data register 8
 */
typedef union {
    struct {
        /** tx_data4 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 4th word to be transmitted
         */
        uint32_t tx_data4:32;
    };
    uint32_t val;
} twaifd_tx_data_8_reg_t;

/** Type of tx_data_9 register
 *  TWAI FD transmit data register 9
 */
typedef union {
    struct {
        /** tx_data5 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 5th word to be transmitted
         */
        uint32_t tx_data5:32;
    };
    uint32_t val;
} twaifd_tx_data_9_reg_t;

/** Type of tx_data_10 register
 *  TWAI FD transmit data register 10
 */
typedef union {
    struct {
        /** tx_data6 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 6th word to be transmitted
         */
        uint32_t tx_data6:32;
    };
    uint32_t val;
} twaifd_tx_data_10_reg_t;

/** Type of tx_data_11 register
 *  TWAI FD transmit data register 11
 */
typedef union {
    struct {
        /** tx_data7 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 7th word to be transmitted
         */
        uint32_t tx_data7:32;
    };
    uint32_t val;
} twaifd_tx_data_11_reg_t;

/** Type of tx_data_12 register
 *  TWAI FD transmit data register 12
 */
typedef union {
    struct {
        /** tx_data8 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 8th word to be transmitted
         */
        uint32_t tx_data8:32;
    };
    uint32_t val;
} twaifd_tx_data_12_reg_t;

/** Type of tx_data_13 register
 *  TWAI FD transmit data register 13
 */
typedef union {
    struct {
        /** tx_data9 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 9th word to be transmitted
         */
        uint32_t tx_data9:32;
    };
    uint32_t val;
} twaifd_tx_data_13_reg_t;

/** Type of tx_data_14 register
 *  TWAI FD transmit data register 14
 */
typedef union {
    struct {
        /** tx_data10 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 10th word to be transmitted
         */
        uint32_t tx_data10:32;
    };
    uint32_t val;
} twaifd_tx_data_14_reg_t;

/** Type of tx_data_15 register
 *  TWAI FD transmit data register 15
 */
typedef union {
    struct {
        /** tx_data11 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 11th word to be transmitted
         */
        uint32_t tx_data11:32;
    };
    uint32_t val;
} twaifd_tx_data_15_reg_t;

/** Type of tx_data_16 register
 *  TWAI FD transmit data register 16
 */
typedef union {
    struct {
        /** tx_data12 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 12th word to be transmitted
         */
        uint32_t tx_data12:32;
    };
    uint32_t val;
} twaifd_tx_data_16_reg_t;

/** Type of tx_data_17 register
 *  TWAI FD transmit data register 17
 */
typedef union {
    struct {
        /** tx_data13 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 13th word to be transmitted
         */
        uint32_t tx_data13:32;
    };
    uint32_t val;
} twaifd_tx_data_17_reg_t;

/** Type of tx_data_18 register
 *  TWAI FD transmit data register 18
 */
typedef union {
    struct {
        /** tx_data14 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 14th word to be transmitted
         */
        uint32_t tx_data14:32;
    };
    uint32_t val;
} twaifd_tx_data_18_reg_t;

/** Type of tx_data_19 register
 *  TWAI FD transmit data register 19
 */
typedef union {
    struct {
        /** tx_data15 : R/W; bitpos: [31:0]; default: 0;
         *  Configures the 15th word to be transmitted
         */
        uint32_t tx_data15:32;
    };
    uint32_t val;
} twaifd_tx_data_19_reg_t;

/** Type of tx_cammand_info register
 *  TWAI FD TXT buffer command & information register
 */
typedef union {
    struct {
        /** txtb_sw_set_ety : R/W; bitpos: [0]; default: 0;
         *  a\\
         */
        uint32_t txtb_sw_set_ety:1;
        /** txtb_sw_set_rdy : R/W; bitpos: [1]; default: 0;
         *  a\\
         */
        uint32_t txtb_sw_set_rdy:1;
        /** txtb_sw_set_abt : R/W; bitpos: [2]; default: 0;
         *  a\\
         */
        uint32_t txtb_sw_set_abt:1;
        uint32_t reserved_3:5;
        /** txb1 : R/W; bitpos: [8]; default: 0;
         *  a\\
         */
        uint32_t txb1:1;
        /** txb2 : R/W; bitpos: [9]; default: 0;
         *  a\\
         */
        uint32_t txb2:1;
        /** txb3 : R/W; bitpos: [10]; default: 0;
         *  a\\
         */
        uint32_t txb3:1;
        /** txb4 : R/W; bitpos: [11]; default: 0;
         *  a\\
         */
        uint32_t txb4:1;
        /** txb5 : R/W; bitpos: [12]; default: 0;
         *  a\\
         */
        uint32_t txb5:1;
        /** txb6 : R/W; bitpos: [13]; default: 0;
         *  a\\
         */
        uint32_t txb6:1;
        /** txb7 : R/W; bitpos: [14]; default: 0;
         *  a\\
         */
        uint32_t txb7:1;
        /** txb8 : R/W; bitpos: [15]; default: 0;
         *  a\\
         */
        uint32_t txb8:1;
        /** txt_buf_ctr : R/W; bitpos: [19:16]; default: 0;
         *  a\\
         */
        uint32_t txt_buf_ctr:4;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} twaifd_tx_cammand_info_reg_t;


/** Group: controller register */
/** Type of rx_frm_counter register
 *  TWAI FD received frame counter register
 */
typedef union {
    struct {
        /** rx_counter_val : RO; bitpos: [31:0]; default: 0;
         *  Configures the received frame counters to enable bus traffic measurement.
         */
        uint32_t rx_counter_val:32;
    };
    uint32_t val;
} twaifd_rx_frm_counter_reg_t;

/** Type of tx_frm_counter register
 *  TWAI FD transmitted frame counter register
 */
typedef union {
    struct {
        /** tx_counter_val : RO; bitpos: [31:0]; default: 0;
         *  Configures the transcieved frame counters to enable bus traffic measurement.
         */
        uint32_t tx_counter_val:32;
    };
    uint32_t val;
} twaifd_tx_frm_counter_reg_t;


/** Group: clock register */
/** Type of clk register
 *  TWAI FD clock configuration register
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** clk_en : R/W; bitpos: [31]; default: 0;
         *  1'b1: Force clock on for register. 1'b0: Support clock only when application writes
         *  registers.
         */
        uint32_t clk_en:1;
    };
    uint32_t val;
} twaifd_clk_reg_t;


/** Group: Version register */
/** Type of date register
 *  TWAI FD version register
 */
typedef union {
    struct {
        /** twaifd_date : R/W; bitpos: [31:0]; default: 35717712;
         *  This is the version register.
         */
        uint32_t twaifd_date:32;
    };
    uint32_t val;
} twaifd_date_reg_t;


