espressif/esp-idf/components/soc/esp32p4/include/soc/twaifd_struct.h
typedef struct {
    volatile twaifd_device_id_reg_t device_id;
    volatile twaifd_mode_setting_reg_t mode_setting;
    volatile twaifd_command_reg_t command;
    volatile twaifd_status_reg_t status;
    volatile twaifd_int_raw_reg_t int_raw;
    volatile twaifd_int_ena_reg_t int_ena;
    volatile twaifd_int_st_reg_t int_st;
    volatile twaifd_int_clr_reg_t int_clr;
    volatile twaifd_bit_timing_reg_t bit_timing;
    volatile twaifd_bit_timeing_fd_reg_t bit_timeing_fd;
    volatile twaifd_err_th_stat_reg_t err_th_stat;
    volatile twaifd_error_counters_reg_t error_counters;
    volatile twaifd_error_counters_sp_reg_t error_counters_sp;
    volatile twaifd_ctr_pres_reg_t ctr_pres;
    volatile twaifd_rx_mem_info_reg_t rx_mem_info;
    volatile twaifd_rx_pointers_reg_t rx_pointers;
    volatile twaifd_rx_status_setting_reg_t rx_status_setting;
    volatile twaifd_rx_data_reg_t rx_data;
    uint32_t reserved_048[6];
    volatile twaifd_filter_a_mask_reg_t filter_a_mask;
    volatile twaifd_filter_a_val_reg_t filter_a_val;
    volatile twaifd_filter_b_mask_reg_t filter_b_mask;
    volatile twaifd_filter_b_val_reg_t filter_b_val;
    volatile twaifd_filter_c_mask_reg_t filter_c_mask;
    volatile twaifd_filter_c_val_reg_t filter_c_val;
    volatile twaifd_filter_ran_low_reg_t filter_ran_low;
    volatile twaifd_filter_ran_high_reg_t filter_ran_high;
    volatile twaifd_filter_control_reg_t filter_control;
    uint32_t reserved_084[4];
    volatile twaifd_tx_stat_reg_t tx_stat;
    volatile twaifd_tx_cfg_reg_t tx_cfg;
    volatile twaifd_tx_data_0_reg_t tx_data_0;
    volatile twaifd_tx_data_1_reg_t tx_data_1;
    volatile twaifd_tx_data_2_reg_t tx_data_2;
    volatile twaifd_tx_data_3_reg_t tx_data_3;
    volatile twaifd_tx_data_4_reg_t tx_data_4;
    volatile twaifd_tx_data_5_reg_t tx_data_5;
    volatile twaifd_tx_data_6_reg_t tx_data_6;
    volatile twaifd_tx_data_7_reg_t tx_data_7;
    volatile twaifd_tx_data_8_reg_t tx_data_8;
    volatile twaifd_tx_data_9_reg_t tx_data_9;
    volatile twaifd_tx_data_10_reg_t tx_data_10;
    volatile twaifd_tx_data_11_reg_t tx_data_11;
    volatile twaifd_tx_data_12_reg_t tx_data_12;
    volatile twaifd_tx_data_13_reg_t tx_data_13;
    volatile twaifd_tx_data_14_reg_t tx_data_14;
    volatile twaifd_tx_data_15_reg_t tx_data_15;
    volatile twaifd_tx_data_16_reg_t tx_data_16;
    volatile twaifd_tx_data_17_reg_t tx_data_17;
    volatile twaifd_tx_data_18_reg_t tx_data_18;
    volatile twaifd_tx_data_19_reg_t tx_data_19;
    uint32_t reserved_0ec[24];
    volatile twaifd_tx_cammand_info_reg_t tx_cammand_info;
    uint32_t reserved_150[4];
    volatile twaifd_err_cap_retr_ctr_alc_reg_t err_cap_retr_ctr_alc;
    volatile twaifd_trv_delay_ssp_cfg_reg_t trv_delay_ssp_cfg;
    uint32_t reserved_168[6];
    volatile twaifd_rx_frm_counter_reg_t rx_frm_counter;
    volatile twaifd_tx_frm_counter_reg_t tx_frm_counter;
    uint32_t reserved_188;
    volatile twaifd_clk_reg_t clk;
    volatile twaifd_date_reg_t date;
} twaifd_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(twaifd_dev_t) == 0x194, "Invalid size of twaifd_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
